// قم بحل السؤال الأول 
// هل فكرت سابقاً في تربية حيوانات أليفة؟
//    <br> قم بإنشاء مصفوفة باسم pets تتكون من أسماء الحيوانات الأليفة
//    <br> التي تربيها أو تفكر في تربيتها (اختر 5
//    حيوانات على الأقل)

//    - قم بإزالة اسم الحيوان الأخير من المصفوفة
//    - قم بإضافة اسم حيوان جديد في نهاية المصفوفة
//    - قم بتغيير اسم الحيوان عند المؤشر 2
let pet = ["cat","rabbit","hamster","dog"];
pet.pop();
console.log(pet);
pet.push("fish");
console.log(pet);
 pet[2] = "fish";
 console.log(pet)
//  قم بإنشاء كائن (object) لقطة 🐈 أو أي حيوان آخر تختاره
//  <br> وأضف إليه الخصائص التالية:
//  <br> اسم الحيوان
//  <br> عمر الحيوان
//  <br> وأخيراً نوع الحيوان/السلالة التي ينتمي إليها

//  - قم بإضافة emoji كخاصية جديدة للحيوان
//  - قم بالوصول إلى عمر الحيوان وطباعته
let cat = {
    name:`sweet`,
    age:`3 month`,
    type:`shirazi`,  
}
console.log(cat);
cat.emoji = `🐈`;
console.log(cat);
console.log(cat.age)
